Repository: mvyskoc/avrtsb
Catalog: avrtsb/locale/*/LC_MESSAGES/pytsb.po
Languages: cs_cz

source: Console Tool for TinySafeBoot, the tiny and safe AVR bootloader. ----------------------------------------------------------------
cs_cz: TinySafeBoot konzolová aplikace, malý a bezpečný zavaděč pro AVR. -----------------------------------------------------------------

source: For more information use: %(prog)s tsb --help %(prog)s fw --help EXAMPLES: Connect to TSB and show bootloader and device info %(prog)s tsb COM1 -i Connection to TSB and write new firmware: %(prog)s tsb COM1 -fw my_program.hex -ew my_eeprom.hex Get list of all supported devices for making firmware: %(prog)s tsb -d help Make custom firmware for ATmega8 with serial interface RX=d0, TX=d1 %(prog)s fw -d ATmega8 -pd0d1 -o tsb_ATmega8_d0d1.hex
cs_cz: Pro více informací použijte: %(prog)s tsb --help %(prog)s fw --help PŘÍKLADY: Připojí se k TSB a zobrazí informace o zavaděči a zařízení %(prog)s tsb COM1 -i Připojí se k TSB a nahraje nový firmware: %(prog)s tsb COM1 -fw my_program.hex -ew my_eeprom.hex Zobrazí seznam všech zařízení pro vytvoření uživatelského firmware: %(prog)s tsb -d help Vytvoří uživatelský firmware pro ATmega8 se sériovým rozhranním RX=d0, TX=d1 %(prog)s fw -d ATmega8 -pd0d1 -o tsb_ATmega8_d0d1.hex

source: Connect to bootloader
cs_cz: Připojení k zavaděči

source: Make custom TSB firmware
cs_cz: Generování uživatelského firmware

source: Connection parameters
cs_cz: Parametry komunikace

source: Device name of genuine or virtual serial port. Use %(prog)s help for list of available devices
cs_cz: Název skutečného nebo virtuálního sériového portu. Použijte %(prog)s help pro výpis dostupných sériových portů.

source: Set the baudrate of the serial port. Default 9600 bps
cs_cz: Nastaví komunikační rychlost sériového portu. Výchozí 9600 bps

source: Password for accessing bootloader
cs_cz: Heslo pro aktivaci zavaděče

source: Reset MCU with DTR line active in LEVEL. Default: --reset-dtr 1
cs_cz: Resetovat MCU linkou DTR aktivní v LEVEL. Výchozí: --reset-dtr 1

source: Reset MCU with RTS line active in LEVEL
cs_cz: Resetovat MCU linkou RTS aktivní v LEVEL

source: Show bootloader and device info
cs_cz: Zobrazí informaci o zavaděči a programovaném MCU

source: TinySafeBoot settings
cs_cz: Konfigurace TinySafeBoot

source: Change password for activating TinySafeBoot loader.
cs_cz: Změna hesla pro aktivaci zavaděče.

source: Change the time how long time the bootloader will wait for activation before the downloaded firmware is started. The waiting time is given by number in range 8..255 (approx 0.1 up to many seconds). The TIMEOUT_FACTOR can be computed from give time in milliseconds and MCU frequency in MHz or Hz.
cs_cz: Nastaví čas jako dlouho bootloader čeká na aktivaci než dojde ke spuštění nahraného firmware. Čas je reprezentován číslem v rozmezí 8..255 (tj. cca 0.1 až několik sekund). TIMEOUT_FACTOR může být vypočten ze zadaného času v ms a MCU frekvence v MHz nebo Hz.

source: Emergency erase after lost password. Reset the contents of the flash ROM and EEPROM to the value '0xff'. The bootloader is not deleted, only TSB password is reset and TIMEOUT_FACTOR set to maximum value 255. Operation is time demanding from 10 s up to 1 minute.
cs_cz: Nozové vymazání při ztrátě hesla. Nastaví obsah paměti flash ROM a EEPROM na hodnotu '0xff'. Zavaděč není odstraněn, pouze je vynulováno heslo a TIMEOUT_FACTOR nastaven na maximální hodnotu 255. Operace je časově náročná od 10 sekund až 1 minuta

source: FLASH programming
cs_cz: Programování FLASH

source: Read flash ROM device memory and write to the specified file
cs_cz: Přečte flash ROM ze zařízení a zapíše do specifikovaného souboru.

source: This will reset the content of the flash ROM to the value '0xff'
cs_cz: Nastaví obsah flash ROM na hodnotu '0xff'

source: Read the specified file and write it to the flash ROM device memory
cs_cz: Přečte určený soubor a zapíše do flash ROM zařízení.

source: Read the specified file and compare it with the flash ROM device memory. When it is used with the option --flash-write than the FILENAME can be omitted.
cs_cz: Přečte určený soubor a porovná s pamětí flash ROM v zařízení. Název souboru může být vynechán, pokud je použito současně s parametrem --flash-write.

source: EEPROM programming
cs_cz: EEPROM programování

source: Read EEPROM device memory and write to the specified file
cs_cz: Přečte paměť EEPROM ze zařízení a uloží do určeného souboru

source: This will reset the content of the EEPROM to the value '0xff'
cs_cz: Nastaví obsah EEPROM paměti na hodnotu '0xff'

source: Read the specified file and write it to the EEPROM device memory
cs_cz: Přečte určený soubor a zapíše do EEPROM paměti v zařízení

source: Read the specified file and compare it with EEPROM device memory. When is used with --eeprom-write option, the FILENAME can be omitted.
cs_cz: Přečte určený soubor a porovná s pamětí EEPROM v zařízení. Název souboru může být vynechán, pokud je použit současně s parametrem --eeprom-write.

source: Force to perform some danger operation: overwrite existing file or write write new bootloader to the device flash ROM.
cs_cz: Vynutí provedení nebezpečné operace: přepsání existujícího souboru nebo zápis nového zavaděče do paměti flash ROM.

source: Type of ATtiny/ATmega device for which the firmware will be made. For the list of all supported devices use --device help
cs_cz: Typ ATtiny/ATmega zařízení pro generování firmware. Pro seznam všech podporovaných zařízení použijte volbu --device help

source: Port definition for serial communication. For example d0d1 means D0=RxD and D1=TxD.
cs_cz: Nastavení portů pro sériovou komunikaci. Například d0d1 znamená D0=RxD a D1=TxD.

source: Name of output file with generated firmware. File will be Hex (.hex) or Binary (other extension)
cs_cz: Jméno výstupní souboru s firmwarem. Soubor bude ve formátu Intel Hex (.hex) nebo binární (pro ostatní přípony)

source: %(prog)s error: argument -b/--buadrate: invalid int value: '%s'
cs_cz: %(prog)s chyba: argument -b/--baudrate: neplatná hodnota '%s'

source: %s: error: argument -fv/--flash-verify: expected 1 argument(s)
cs_cz: %s: chyba: parametr -fv/--flash-verify: očekává 1 argument

source: Argument can be omitted only when is used with option --flash-write
cs_cz: Argument může být vynechán pouze v kombinaci s --flash-write

source: %s: error: argument -fv/--eeprom-verify: expected 1 argument(s)
cs_cz: %s: chyba: parametr -fv/--eeprom-verify: očekává 1 argument

source: Argument can be omitted only when is used with option --eeprom-write
cs_cz: Argument může být vynechán pouze v kombinaci s --eeprom-write

source: %s: error: argument --change-timeout: expected 1 or 2 argument(s)
cs_cz: %s: chyba: parametr --change-timeout: očekává 1 nebo 2 argumenty

source: Cannot access firmware database.
cs_cz: Chyba při otevírání databáze s firmwarem.

source: pytsb fw: error: argument -d/--device expected., Use --device help for list of all supported devices.
cs_cz: pytsb fw: chyba: očekáván argument -d/--device. Použijte --device help pro výpis všech podporovaných zařízení.

source: pytsb fw: error: argument -p/--rxtx expected.
cs_cz: pytsb fw: chyba: očekván argument -p/--rxtx.

source: pytsb fw: error: argument -p/--rxtx must be in the form d0d1, where D0 = RxD, and D1=TxD.
cs_cz: pytsb fw: chyba: argument -p/--rxtx musí být ve formátu d0d1, kde D0=RxD a D1=TxD.

source: Output file '%s' already exist, do nothing.
cs_cz: Výstupní soubor '%s' už existuje, končím.

source: List of available ports:
cs_cz: Seznam dostupných portů:

source: List of standard baudrates, not all of them must be supported:
cs_cz: Seznam standardních rychlostí. Ne všechny musí být podporovány.

source: Error: output file "%s" already exist. Use --force option or delete the existing file.
cs_cz: Chyba: výstupní soubor "%s" už existuje. Použijdte parameter --force nebo smažte existující soubor

source: Data verification OK
cs_cz: Ověření dat OK

source: Flash ROM device verification error
cs_cz: Chyba ověření paměti flash ROM

source: Warning: firmware includes SPM instruction, which can be dangerous for bootloader. Use --force option if you really wish to write to device flash ROM.
cs_cz: Varování: firmware obsahuje SPM instrukci, ktrerá může poškodit zavaděč Použijte parametr --force, pokud si opravdu přejete provést zápis do flash ROM

source: Firmware includes SPM instruction. Continue to write to the device flash ROM --force option is used.
cs_cz: Firmware obsahuje SPM instrukce. Pokračuji v nahrávání do zařízení vynuceno volbou --force

source: EEPROM verification error
cs_cz: Chyba ověřování paměti EEPROM

source: EEPROM Erase OK
cs_cz: Vymazání paměti EEPROM OK

source: EEPROM Write OK
cs_cz: Zápis EEPROM OK

source: Input file "%s" not found.
cs_cz: Vstupní soubor "%s" nenalezen.

source: Not supported file format. Only only Intel Hex (.HEX) or raw binary files (.BIN) are supported.
cs_cz: Nepodporovaný format souboru. Podporován je pouze formát Intelx Hex (.HEX) nebo binární soubor (.BIN).

source: Write user data OK
cs_cz: Zápis uživatelských dat OK

source: Timeout factor %d
cs_cz: Timeout faktor %d

source: Password: %s
cs_cz: Heslo: %s

source: Emergency erase is takes from 10s up to 1 minute
cs_cz: Nouzové vymazání trvá 10s až 1 min.

source: Please be patient
cs_cz: Prosím buďte trpělivý

source: Ressetting MCU, I try to access TSB without password.
cs_cz: Resetuji MCU, pokouším se o přístup zavaděče bez hesla.

source: List of all supported devices:
cs_cz: Seznam všech podporovaných zařízení:

source: Sorry firmware is not supported for '%s' .
cs_cz: Promiňte firmware není dostupný pro zařízení '%s'

source: Device '%s' doesn't support ports '%s'
cs_cz: Zařízení '%s'nepodporuje zadané porty '%s'

source: Supported ports are: %s
cs_cz: Podporované porty jsou: %s

source: TSB firmware saved to file: '%s'
cs_cz: TSB firmware uložen do souboru: '%s'

source: Bad info data block received !
cs_cz: Přijat chybný datový blok !

source: Pagesize not valid - abort.
cs_cz: Neplatná velikost stránky - ukončuji

source: Error: Confirmation of header expected.
cs_cz: Chyba: očekáváno potvrzení přijetí hlavičky

source: Timeout factor must be in range 8..255
cs_cz: Timout faktor musí být v rozmezí 8..255

source: Maximum lenght of password is %d
cs_cz: Maximální délka hesla je %d

source: VERSION : %d
cs_cz: VERZE : %d

source: SIGNATURE : %.2X %.2X %.2X
cs_cz: PŘÍZNAK : %.2X %.2X %.2X

source: DEVICE : %s
cs_cz: ZAŘÍZENÍ : %s

source: PAGESIZE : %d
cs_cz: STRÁNKA : %d

source: reset_line attribute can have only TSBLoader.DTR, TSBLoader.RTS value.
cs_cz: atribute reset_line může nabývat hodnot TSBLoader.DTR, TSBLoader.RTS

source: reset_active attribute can have only values only 0, 1
cs_cz: atribut reset_active může mít pouze hodnoty 0, 1

source: Timeout error - TSB does not respond
cs_cz: Timeout, čas vypršel - TSB neodpovídá

source: Comunication error: invalid answer from TSB
cs_cz: Chyba komunikace: neplatná odpověď od TSB

source: User data read error.
cs_cz: Chyba čtení uživatelských dat.

source: User data write error.
cs_cz: Chyba zápisu uživatelských dat.

source: One-wire interface detected.
cs_cz: Detekováno jednotrátové sériové rozhranní.

source: Error: Device does not respond.
cs_cz: Chyba: zařízení neodpovídá.

source: Please check your password.
cs_cz: Prosím ověřte vaše heslo.

source: Maybe password is required.
cs_cz: Možná je vyžadováno heslo.

source: Read flash memory page error.
cs_cz: Chyba čtení paměťové stránky flash ROM.

source: Flash read %.4X
cs_cz: Čtení flash ROM %.4X

source: Read Error: other memory page expected.
cs_cz: Chyba čtení: očekávána další paměťová stránka.

source: Error: Not enough space.
cs_cz: Chyba: nedostatek místa.

source: Flash write %.4X
cs_cz: Zápis flash ROM %.4X

source: Error: end of appflash reached or verifying error
cs_cz: Chyba: dosažen konec paměti flash ROM nebo chyba ověření

source: FLASH Write: Undefined error.
cs_cz: Zápis flash ROM: neznámá chyba

source: Error: EEPROM not enough space.
cs_cz: Chyba: nedostatek místa EEPROM

source: EEPROM write %.4X
cs_cz: EEPROM zápis %.4X

source: Error: end of eeprom reached or verifying error
cs_cz: Chyba: dosažen konec paměti EEPROM nebo chyba ověření.

source: EEPROM Write: Undefined error.
cs_cz: Chyba zápisu EEPROM - neznámá chyba.

source: Read EEPROM memory page error.
cs_cz: Chyba čtení stránky paměti EEPROM.

source: EEPROM read %.4X
cs_cz: Čtení EEPROM %.4X

source: Read Error: other EEPROM page expected.
cs_cz: Chyba čtení EEPROM, očekávána další stránka.

source: TSB is accessible without password.
cs_cz: TSB přístupné bez hesla.
